In [1]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt

In [2]:
url = "https://github.com/FazlullahBokhari/Datasets/blob/main/PH-Sales.csv?raw=true"
dataset = pd.read_csv(url)

In [3]:
dataset

    Month-Year  Number of Tractor Sold
0       Jan-03                     141
1       Feb-03                     157
2       Mar-03                     185
3       Apr-03                     199
4       May-03                     203
..         ...                     ...
139     Aug-14                     848
140     Sep-14                     640
141     Oct-14                     581
142     Nov-14                     519
143     Dec-14                     605

[144 rows x 2 columns]

In [4]:
dataset.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 144 entries, 0 to 143
Data columns (total 2 columns):
 #   Column                  Non-Null Count  Dtype
---  ------                  --------------  -----
 0   Month-Year              144 non-null    object
 1   Number of Tractor Sold  144 non-null    int64
dtypes: int64(1), object(1)
memory usage: 2.4+ KB

In [6]:
len(dataset['Month-Year'])

144

In [10]:
dates = pd.date_range(start='01/01/2003', periods=len(dataset),freq='MS')

In [11]:
dates

DatetimeIndex(['2003-01-01', '2003-02-01', '2003-03-01', '2003-04-01',
               '2003-05-01', '2003-06-01', '2003-07-01', '2003-08-01',
               '2003-09-01', '2003-10-01',
               ...
               '2014-03-01', '2014-04-01', '2014-05-01', '2014-06-01',
               '2014-07-01', '2014-08-01', '2014-09-01', '2014-10-01',
               '2014-11-01', '2014-12-01'],
              dtype='datetime64[ns]', length=144, freq='MS')

In [14]:
dataset['month'] = dates.month

In [15]:
dataset['year'] = dates.year

In [16]:
dataset

    Month-Year  Number of Tractor Sold  month  year
0       Jan-03                     141      1  2003
1       Feb-03                     157      2  2003
2       Mar-03                     185      3  2003
3       Apr-03                     199      4  2003
4       May-03                     203      5  2003
..         ...                     ...    ...   ...
139     Aug-14                     848      8  2014
140     Sep-14                     640      9  2014
141     Oct-14                     581     10  2014
142     Nov-14                     519     11  2014
143     Dec-14                     605     12  2014

[144 rows x 4 columns]